Repository: atlas-studios/Session2-G9
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 随着一阵短暂而急促的咒文吟唱声传出，老梅林手上陡然燃起一片红色光焰，只见他手中的法杖猛的一顿，在场众人只觉四周空间一阵扭曲，一朵朵仿佛来自地狱的红莲，在呼啸声中，拖着长长的尾焰轰向翡翠高塔。
en_us: With a short and rapid recitation of the spell, a red flame lit up on Old Merlin's hands. With a stamp of the staff in his hand, everyone present seemed to feel a distortion of the space in the surrounding. Stalks of red lotus with their long flaming tails in tow emerged as if from hell and bombarded the Emerald Tower amidst the howl.

source: 随着凯文手中的锤子又一次落下，稍稍中断的拍卖又继续开始了。
en_us: With Kevin's gavel hammering down once again, the auction resumed.

source: 随着天帝身体的不断消融，当那烈火的温度达到无限灼热，亮度达到无限夺目的那一刻，天帝和火焰同时消失在了天地之间。
en_us: The Celestial Thearch's body melted as he spoke, and when the temperature of the raging fire reached an unimaginable peak, so high that it became blinding, the Celestial Thearch and the flames vanished from the world.

source: 随着最后一句咒文被喝破，一层坚硬无比的冰甲覆盖在中年男人身上，在止住伤口鲜血喷涌的同时，也让双足飞龙势在必得的一击落到了空处，那种感觉就象抓到了钢铁上一般，锥心的疼痛从爪子上传来，让双足飞龙发出一阵阵痛苦而愤怒的嘶吼声。
en_us: As the last of the spell broke out, a hard layer of ice armor covered the middle-aged man. While stopping the bleeding of the wound, it also made the Wyvern's strike fall into an empty spot. An excruciating pain shot up from the Wyvern's talons, like having caught onto steel. The Wyvern roared in fury and agony.

source: 随着水晶球上的光芒越来越耀眼，葛瑞安脸上的笑容也越来越浓。
en_us: As the light on the crystal ball glowed brighter, so did the smile on Gerian's face.

source: 随着老人一步步走近，林立一双眼睛，也一点点的亮了起来。
en_us: As the old man approached them, Lin Li's eyes lit up slightly.

source: 随着老梅林的话音落下，四周的魔法元素忽然呈现出一阵剧烈的波动，就好象一个巨大的旋涡正在扩散，身处旋涡之中，林立更是感受到了一股空前的压力，他必须死死的咬紧牙关，才能保证自己不在这股压力下屈服。
en_us: As Old Merlin's voice settled, the magical elements in the surrounding turned into a violent wave, like a giant vortex spreading across. Lin Li felt an unprecedented pressure standing in the center of this vortex. He had to clench his teeth tightly to ensure he wouldn't bend under this immense pressure.

source: 随着葛瑞安话音落下，翡翠高塔外的气氛，顿时变得剑拔弩张，所有人的心都提了起来,这可不象刚才林立与老梅林的争斗，那说到底不过是打了儿子老子出头罢了，现在站在这里的两个人，同样是十五级以上的大魔导士，同样领导着加洛斯最大的两支势力之一。
en_us: As Gerian's voice fell, the atmosphere outside Emerald Tower turned intense. All hearts were lifted to their mouths. This was not a battle between Lin Li and Old Merlin like the one before, that was merely a revenge from the father for beating up his son. Now, both men standing were archmages over level-fifteen, and were likewise two of the top powers leading Jarrosus.

source: 随着裂缝的扩大，那双白骨大手硕大的头颅和上半身终于也钻了出来。其头颅处空洞的眼眸内闪耀着诡异的红光，其白色骸骨上不住流转着密密麻麻、隐隐发亮的暗灰色符文，释放出一股令人恐惧窒息的死气，连附近的空气都凝滞了流动。
en_us: As the crack widened, the owner of the pair of skeletal hands slowly emerged and stood up. Strange red lights shone from the hollows of its cranial cavities, and its white, bony body, covered in countless greyish runes, glowed steadily. A frightening lifeless aura was released, causing the surrounding air to stagnate.

source: 随着许愿术卷轴被轻轻展开，明月城的上空忽然挂起了一道彩虹，七彩斑斓的光芒柔柔洒下，让整个明月城看上去就仿佛被梦境笼罩一般，庄严神圣的颂唱声中，一阵威严的声音传来，仿佛远在天边，却又仿佛近在身旁。
en_us: As the scroll of Wishes gently unfolded, a rainbow appeared suddenly on the skies of Bright Moon City. The colorful rays shone down lightly, and the whole city seemed to be enshrouded in a dream. A majestic voice rang through the solemn and divine choir, a voice that appeared to come from afar yet near at the same time.

source: 随着那一丝精神力的变化，魔力走向又忽然转了个一百八十度的大弯，饶过复杂的魔力回路，瞬间激活了绿宝石周围的十三个魔力节点，紧跟着林立将手一抬，点金棒落到了怒焰之袍之上，刹时间就只见一片符文升腾而起，怒焰之袍上呈现出一阵扭曲的魔法波动，等到这一切渐渐平息之时，林立已经完成了在安瑞尔世界的第一次附魔。
en_us: With the change of the mental strength, the mana suddenly took a 180 degree turn, bypassing the complex magic circuit and activating the 13 magic nodes surrounding the emerald. Then, Lin Li lifted his hand and the gold rod landed on the Robe of Wrath. A series of runes arose instantly and there was a distorted magical wave on the Robe of Wrath. By the time all these had subsided, Lin Li had completed his first magical enchantment in Anril.

source: 随着那句说话的结束，只见原本覆盖在天庭外围，整个璀璨夺目的耀眼护罩突然熄灭了下来，防护屏障消失得无影无踪，那原本游走宛如复活生命的草木百兽雕刻悉数停止了动弹，各处建筑内外的七彩符文也不再发光。
en_us: Following those words, the resplendent and dazzling barrier that shielded the Heavenly Court's periphery suddenly diminished before disappearing completely. The lively floral and creature carvings stopped moving, and the rainbow-colored runes inside and outside the buildings stopped emitting light.

source: 隐约之中，他听到了江小奴小声的解释声，还有荣管事怒气冲冲的训斥声，直到片刻后江小奴才小跑进了后院：“少爷，荣管事走了，不过他说明天一早让你去找他，去西山药田清点。”
en_us: Vaguely, he heard Jiang Xiaonu explaining things in a low volume, as well as Chief Rong's rage-filled shouts of stern rebuke. After a short period of time, Jiang Xiaonu ran into the backyard. "Young Master, Chief Rong has left. However, he said that he wants you to find him tomorrow morning and account for the medicinal herbs at the Western Hills."

source: 难怪他一眼就能看出麦格雷尼先生的病因，又能够配出如此古怪的药剂，原来他根本就是一位真正的药剂师！
en_us: It was no wonder he could see the cause of Mr McGrenn's illness at once and concoct such a peculiar potion. So he turned out to be a real pharmacist!

source: 雅阁内的江逸心情很是忐忑，第一次上这种大地方，此刻还在等待对方定夺，心里不紧张的假的。好在他整张脸都笼罩在斗篷内，多年的压抑生活也让他的性格沉稳了很多。
en_us: Jiang Yi, who was inside the booth, was in a nervous mood. This was the first time he had been to such a major location; on top of that, he had to wait for his counterpart to evaulate and make a decision on the offer. He would be lying if he said he was not anxious. Thankfully, his entire face was entirely shroudded by his black cloak, while his steady personality and much calm composure was much developped by many years of oppressive cruel life.

source: 霍伦一句话出口，四周顿时传来几声吸气的声音。
en_us: When Hoeren spoke, breathing sounds immediately came from all four sides.

source: 霍伦一句话出口，马森就一下呆住了。
en_us: Hoeren's words stunned Marson.

source: 霍伦倒不怎么恼怒，以他今时今日的实力和地位，除了伤害巴瑟罗尔的凶手之外，一般的冒犯还不足以让他生气，他只是点了点头：“既然你们想跟他一起去公会地牢，我可以给你们这个机会。”
en_us: Hoeren was not particularly angry. With his current strength and standing, a normal offense was not enough to make him angry, other than injuring Bathrilor's assailant. He simply nodded: "Since you so desire to go to the dungeon with him, I can give you this chance."

source: 霍伦怎么也没想到，这次最高议会的试炼，加洛斯魔法公会派来的，居然就是这个费雷。
en_us: Hoeren would never have imagined that the Jarrosus Guild of Magic would actually send Felic to the Supreme Council trial.

source: 霍伦毕竟是奥德文的儿子，真要把他给杀了，搞不好会给安度因带来一些麻烦，反正自己也没什么损失，只是受了些惊吓而已，没必要把事情搞得这么大……
en_us: Hoeren was indeed Odwin's son. If Andoine really were to kill him and things didn't go well, it would spell trouble for Andoine. Lin Li did not suffer any losses anyway, only that he was somewhat frightened. There was no need for the situation to escalate to such an extent...

source: 霍伦沙哑的声音刚刚落下，三人就忽然感觉到一股庞大的压力传来，而压力的来源，正是那个身穿黑袍的中年人，此时的霍伦，与先前比起已是截然不同，浑身上下都散发出强大的气息。
en_us: The moment Hoeren finished speaking, the three suddenly felt a large burst of pressure. The source of the pressure was that middle-aged man clad in a black robe. The Hoeren now was completely different from just now: his whole body radiated a powerful aura from head to toe.

source: 霍伦甚至都已经想好了，只要将他关进地牢，就立刻动用各种关系，务必让他在最短的时间里，受尽最痛苦的折磨而死。
en_us: Hoeren had even planned that as long as he locked Felic in the dungeon, he would use his various connections to ensure that Felic would suffer the the worst torture in the shortest amount of time, and die as a result.

source: 霍伦的右手上，一枚镶嵌着红宝石的戒指，正透出淡淡的魔法波动。
en_us: On Hoeren's right hand, his ring finger that was embedded with a ruby started to give off a faint spell of magic.

source: 霍伦紧紧握住手中法杖，漫长而又复杂的咒语吟唱声，在树林间久久回荡……
en_us: Hoeren tighly gripped the staff in his hand. The chant of a long and complex spell resounded in the forest...

source: 霎时间天地为之呼号，风云为之变色，虚空为之震荡！
en_us: Instantly, the heaven and earth cried out, the winds and clouds changed color, and the space shuddered!

source: 靠！真是药剂大师！
en_us: Damn! Really a Master of Potion!

source: 面对会长大人突如其来的怒气，一群魔法师顿时就给吓傻了，一个个战战兢兢的望着葛瑞安，身子拼命的往后缩，生怕老家伙把血溅到他们身上，一时间林立周围空下好大一块地方，就他一个人象没事似的坐在那，还有空伸出手来往葛瑞安头上指了指，很好心的提醒他注意形象。
en_us: Faced with the President's sudden rage, the group of mages were scared silly at once. They looked at Gerian with trepidation and desperately shrank back for fear that the old fellow might spill blood on them. For the moment there was a big space around Lin Li, and he sat there by himself as if nothing had happened and still had the time to stretch out his hand and point to Gerian's head, kindly reminding him of his image.

source: 面对如日中天的魔法公会，他很明智的选择了主动示好。
en_us: In the face of the Guild of Magic that was at its height of influence, he had wisely chosen to take the initiative to befriend them.

source: 项链握在手中，又是一个火焰之手，庞大的魔力一放即收，等他再将手张开时，细细的深邃之银项链已是被融成了薄薄的一片，整个过程更是快得吓人，一放一收只是眨眼之间，一直到他将深邃之银薄片覆在点金棒上时，才微微感觉到手心有些发烫。
en_us: Holding the necklace in the hand, he unleashed the Flaming Hands again, the massive power recalled as soon as it was released. When he opened his hand again, the fine deep silver necklace had been melted into a thin piece. The whole process was tremendously fast, the release and recall of his mana was done in a flash. It was not until he had covered the gold rod with the thin piece of deep silver that he somewhat felt his palms burning.

source: 顺利将五项技能升到大师级别，林立终于是停下来歇了口气，正当所有人都以为他要收手的时候，林立却从背包里拿出了愿望术卷轴。
en_us: Lin Li finally stopped to catch his breath after successfully upgrading his skills to the mastery level. Just when everyone thought he'd finally call it a day, he took out the scroll of Wishes from his bag.

source: 风月楼的债务，压得江逸透不过气来，此刻这武殿既然看重他，他自然想在这先弄十两紫金去还债。
en_us: The debt problems with the Fengyue Brothel bore down on Jiang Yi so much that he could not breathe. At the moment, since this Martial Arts Hall saw him so highly, he naturally thought of first getting the ten taels of purple gold to pay back his debts.

source: 风月楼的护卫连忙把令牌递给马飞，马飞抓着令牌上的绳索吊在半空在江逸面前晃了晃，戏谑说道：“想要令牌？没门！”
en_us: The guard of Fengyue Brothel immediately handed over the command token to Ma Fei, who mockingly dangled it by its strings in mid-air in front of Jiang Yi, "You want the command token? No way in hell!"

source: 风月楼的管事看到江逸上门，和安坐喝茶的马家公子赔笑两句，转头望着江逸戏谑开口道：“哦？一月之期还没到，你就上门了？是否弄够了足够的紫金？”
en_us: Upon seeing Jiang Yi at the door, the housekeeper of Fengyue Brothel smiled apologetically at the Ma Family young master casually sipping tea, before turning to Jiang Yi and jeered, "Oh? You are here before the one-month deadline is up? Did you manage to acquire enough purple gold?"

source: 风月楼离开江家不远，但江逸和江小奴却足足走了小半个时辰才回到江家西院。
en_us: Fengyue Brothel was not very far from the Jiang Residence, but Jiang Yi and Jiang Xiaonu ended up taking an entire hour to return to the Jiang Residence Western Court.

source: 马修斯－梅林的儿子，却要向这些低级魔法师主动示好，这种事情对骄傲的克伦威尔来说，简直比杀了他还难受。
en_us: He was the son of Matthew Merlin, yet he had to lower his head and be the one taking the initiative to befriend these low-level mages. To the arrogant Cromwell, this was worse than killing him.

source: 马家作为天羽城五大家族之一，他们家族的一举一动都被其余家族所关注，不过马飞不想把这事闹得人尽皆知，所以其余家族只是知道马家在找一个人，一个铸鼎境二重，十五六岁的少年。
en_us: Being one of the five great families in Skyplume City, every action made by the Ma Family was under the scrutiny of the other families. However, as Ma Fei did not wish to have the incident revealed publicly, the rest of the families only knew that the Ma Family was looking for a someone - a youth aged around 15 or 16 years old, who was at the second stage of the Cast Tripod Realm.

source: 马家和江家是世仇，这管事知道他是江家子弟，江逸暗道不妙，却看到那管事已经注意到他了，只能硬着头皮朝里面走去。
en_us: The Ma Family and the Jiang Clan were mortal enemies. Additionally, this housekeeper knew that he was a son of the Jiang Clan. Jiang Yi muttered to himself that something was amiss, but seeing as he had already caught the attention of that housekeeper, he could only brace himself and walk further into the building.

source: 马家大少马黑旗，柳家柳河，冷家冷千军，江家江恨水，这四名大家族少爷追求了姬听雨数年，姬听雨一直不冷不热，此刻却连续找一名陪练两次？最重要的是……这陪练还是青铜级别的垃圾武者，这事明显有些诡异。
en_us: Ma Family Great Young Master Ma Heiqi, Liu Family Young Master Liu He, Leng Family Young Master Leng Qianjun, and Jiang Clan Jiang Henshui - these four young masters from the four great families had been courting Ji Tingyu for years, whereas she remained ever unreceptive to their attempts. Yet she ordered this sparring partner twice in a row? More importantly... he was just some bronze token-grade, underclass martial artist. It was indeed peculiar...

source: 马家少爷目光在江逸身上一扫，朝管事招手道：“刘管事，什么江家？这令牌是什么回事？”
en_us: The Ma Family young master swept a glance across Jiang Yi and motioned for the housekeeper, "Housekeeper Liu, what do you mean by the Jiang Clan? What's this about the command token?"

source: 马家少爷看都没看江逸一眼，一人端着茶杯悠闲地喝着茶，似乎江逸这等小人物和这风月楼的姑娘般，一样的下贱，无足轻重。
en_us: The Ma Family young master spared Jiang Yi nary a glance and seemed content with drinking tea in solitude. He acted as if Jiang Yi was a nobody, as if he was like the girls in this Fengyue Brothel - unworthy and low-bred.

source: 马家少爷神色不变，低垂着头悠然喝了一口茶道：“瞧你说的，我过来可是办事的，不知道的人还以为本少爷是过来找乐子的……”
en_us: Keeping a neutral expression, the Ma Family young master ducked his head and took a casual sip of tea, "What are you saying. I'm here for business, yet the way you put it would make those who don't know better think I'm here for pleasure..."

source: 马家少爷笑了笑，很满意的拍了拍管事的肩膀，起身就要朝楼上走去。
en_us: The Ma Family young master smiled and patted the housekeeper's shoulder in satisfaction, getting up to make his way upstairs.

source: 马家江家子弟常有冲突，去年江如龙把马家两名子弟打得瘫痪，对方都不敢找上门来，最后不了了之。此刻他既然回到了江家大院，那自然也就安全了。
en_us: The descendants of the Ma and Jiang families had frequent conflicts. Last year, Jiang Rulong had beaten up two descendants of the Ma Family so badly that they were paralyzed, yet the Ma Family did not come to the Jiang Clan for revenge, and the matter was concluded without being settled. Therefore, Jiang Yi knew he was safe now that he was back in the Jiang Clan courtyard.

source: 马森会不会疯掉，安度因可一点也不关心，他现在正忙着从口袋里掏东西。
en_us: Andoine did not care whether or not Marson went crazy. He was busy fishing something out of his pocket.

source: 马森的目光呆滞住了，从小到大，他不知道听过多少，关于这位传奇法师的故事，但他却从来也没有想过，有一天，这样一位充满传奇色彩的人物，会活生生的站在自己面前，而且看上去，竟还跟自己的室友关系不浅……
en_us: Marson's gaze was fixed on him. Since he was young, he had heard countless stories about this legendary mage, but had never imagined that one day, such a legendary figure would be standing right in front of his very eyes. And it seemed as if he shared some sort of relationship with his roommates...

source: 马飞一看江逸这样子，不仅不害怕反而大笑起来，在他看来江逸这铸鼎境二重的废物，如果敢动手今日只有爬着回去，不说风月楼内有七八名护卫，就凭铸鼎境四重的他，一招就能废了他……
en_us: Seeing Jiang Yi like this only made Ma Fei laugh out loud, without an ounce of fright. To him, Jiang Yi was a useless person who was only at the second stage of the Cast Tripod Realm. If Jiang Yi dared to attack, he would only end up being knocked down and dragged out. To say nothing of the seven or eight guards in Fengyue Brothel, just Ma Fei alone, who was at the fourth stage of the Cast Tripod Realm, would be able to cripple him with just one blow...

source: 马飞不再理会刘管事，眼睛怨毒的望着天花板，咬牙切齿的喃喃道：“不将你挫骨扬灰，我马飞誓不为人……”
en_us: Ma Fei stopped paying attention to Housekeeper Liu and stared at the ceiling in bitter resentment. "I, Ma Fei, vow to shatter your bones and scatter the ashes into the wind, or I cease to be a man..."

source: 马飞伸手弹了弹衣袍，笑道：“不多，我算了下，你随便给个百两紫金，这事就算我给江恨水面子，不予追究了……”
en_us: Ma Fei smoothed out his clothes, brushing off imaginary dust, and said with a smirk, "Not much. I did a rough calculation: why don't you just pay something like a hundred tael of purple gold, and I will give face to Jiang Henshui and consider this case closed..."

source: 马飞冷笑一声，慢悠悠的走了过来，站在江逸面前伸出一只手指，点着他面门道：“你算什么东西？你的侍女在我家楼子内做工，损坏东西不说，你敢出手伤人？这事就算闹到城主府去我们马家也不怕，区区十两紫金也想打发？你以为我们马家是要饭的？令牌拿来！”
en_us: Smiling coldly, Ma Fei sauntered over and stood in front of Jiang Yi. He held up a finger and jabbed at Jiang Yi's forehead, "Who do you think you are? Your maidservant worked at my brothel; to say nothing of her damaging our property, you had the audacity to attack our men? The Ma Family would not let this matter go even if the City Lord were to hear of it, yet you presume you can patronize us with a mere ten taels of purple gold? Do you think our family is made up of beggars? Hand me the command token now!"

source: 马飞少爷很快就冷笑起来，盯着江逸看了几眼，突然冷哼道：“毁掉了我们镇楼的名画，打伤了我们的人，就这么轻易的想把事了了？这事就算江恨水在这也说不过去吧？”
en_us: A sardonic smile soon appeared on Young Master Ma Fei's face. After staring at Jiang Yi for a few moments, he suddenly gave a derisive snort, "You destroyed the famous painting that was the treasure of our brothel, and attacked our men. Yet you wish to settle things so easily? What you did couldn't be absolved even if Jiang Henshui himself were here, don't you think?"

source: 马飞悠然一笑，淡淡说道：“赔钱！那幅画十两紫金，你已经赔了，你再把打伤我们楼子护卫的药钱，还有毁坏我们风雨楼声誉费赔了，这令牌我利马还你。”
en_us: Ma Fei gave a slow smile and said coolly, "Pay up for the damages! You've paid the ten taels of purple gold for the painting, sure. I will return the command token to you immediately, but only if you compensate the medical expenses for beating up our brothel's guards, and recompense for vilifying Fengyue Brothel's reputation."

source: 马飞暴跳如雷，让刘管事不断砸钱找人，就算把天羽城翻一遍也要找到江逸，而且搜索范围还扩大到了方圆百里的小镇上。江逸废了他，毁了他的一辈子，不杀江逸他日不能食，夜不能寐，几乎要入魔了。
en_us: Ma Fei was in a thunderous rage. He had Housekeeper Liu to find Jiang Yi regardless the cost, even if it meant turning Skyplume City upside down. The search radius was also expanded to the surrounding towns 50 kilometers away. Jiang Yi had rendered him useless and destroyed his life. He was a man possessed, unable to eat nor sleep, being consumed entirely by the the thought of killing Jiang Yi.

source: 马飞深深地吸了一口气，闭上眼睛休息了一会才开口道：“这事别上报家族，让人偷偷给我父亲带着信，还有……十天之内，我要得到这个杂碎的一切信息，如果查不来你们所有人自裁吧！”
en_us: Ma Fei took a deep breath, closing his eyes and resting for a moment before saying, "Do not inform the family clan about this incident. Have someone to pass a message to my father in secret, and... in ten days, I want every bit of information about this rascal delivered to me. If it cannot be done, all of you are to take your own lives!"

source: 马飞看起来年纪比他还要大上两三岁，却还只是铸鼎境四重，天资明显有限。就算被他废了马家也不会大动干戈，最多马飞的老爹暴怒如雷，暗中派人刺杀他。
en_us: From appearances, Ma Fei seemed two to three years older, yet he was only at the fourth stage of the Cast Tripod Realm - an indication of his obviously limited talent. Although he was rendered useless, the Ma Family would not make too much of a fuss. At the very most, Ma Fei's father would fly into a thunderous rage and try to have Jiang Yi assassinated.

source: 马飞突然放声大笑起来，艰难的扭转脖子，阴狠的盯着江逸道：“见冥帝？你敢杀本少爷？给你一万个胆子你试试？我父亲是马庸，你敢杀我就算你们江家家主都保住你。小杂碎，我告诉你，你完了！今日之事我发誓必百倍偿还，不将你弄成废人我马飞誓不为人。”
en_us: Ma Fei burst out laughing. He turned his neck with difficulty and cast savage eyes upon Jiang Yi, "Meet the Netherworld Emperor? Do you dare to kill this young master? How about you give it a try when you are ten thousand times braver than you are now? My father is Ma Yong; if you have the guts to kill me, even the Jiang Clan Clan Head would not be able to save you. You little rascal, I'll have you know that you are done for! I swear there will be retribution for what you did today, with a hundred-fold interest. I, Ma Fei, vow to render you useless, or I cease to be a man."

source: 骚动持续了大概半个小时，大厅里终于渐渐安静了下来，台上的凯文依旧带着笑容，用手中的锤子在台上一敲：“奥法药剂拍卖，现在正式开始！”
en_us: The hubbub continued for about half an hour when at last the hall gradually quiet down. Kevin, standing on the stage, still had the smile on his face as he hit the table with the gavel in his hand. “The auction for the Arcane Magic Potion officially begins now!"

source: 高大的骸骨巨人带着百万钧之力，重重地撞击在由符芒映衬下的气罩上，眨眼便被反震为无数骨屑碎末，护罩没有一丝晃荡。
en_us: The huge skeleton giant struck down with the force of a million pounds upon the dome formed by the runic halos. In a blink of an eye, it was reduced to dust from the aftershock, but the shield did not sway a single bit.

source: 高级铁匠用秘银锻造，敲成废铁那是理所当然的事，不过是不是敲成废铁对林立来说其实都没什么区别，他不缺那几百金币，也不缺那几块秘银，事实上在闪光平原千针石林等很多地方，他都拥有自己的私人矿脉，只是没人知道罢了……
en_us: Top-class blacksmiths used mithril in their forging, hence it was natural to turn mithril into scrap iron. However, it made no difference to Lin Li whether the mithril was hammered into scrap iron. He was neither short on that few hundred gold coins, nor was he short on these few pieces of mithril. In fact, he had his own private mineral veins in places like the Glistening Plains and Thousand Pinnacles, but no one knew about it...

source: 魔力如潮水一般涌出，水晶球开始渐渐发亮。
en_us: The power gushed out like tide water, and the crystal ball began to glitter.

source: 魔晶一抓一大把的人，居然也有脸嚷嚷，我已经这么穷了？
en_us: Someone who could grab a handful of magical crystals at once actually had the gall to complain that he's poor?

source: 魔晶上升腾而起的青色火焰熊熊燃烧着，与此同时四周的魔法波动也终于到了极限。
en_us: The green flame rising up from the magical crystals raged on, and at the same time the surrounding magical wave had reached its peak.

source: 魔法公会坐落在加洛斯城南端，那是一幢丝毫不逊色于冒险者公会的庞大建筑物，在加洛斯城，魔法公会又被称为翡翠之塔，站在街上远远望去，就能看见那高高的塔尖。
en_us: The Guild of Magic was located at the southern end of Jarrosus City. It was a huge building as well, no less so than the Adventurers Guild. The Guild of Magic was also known as the Emerald Tower in Jarrosus City. Standing on the streets, one would be able to see the tall spire of the tower from a distance.

source: 魔法公会跟梅林家族虽然有些摩擦，但大家毕竟是加洛斯城最大的两支势力，一旦克伦威尔在这里出点什么事，凯文真不敢想象加洛斯城会乱成什么样……
en_us: Although the Guild of Magic had some frictions with the Merlin Family, they were after all the top influence in Jarrosus City. If anything happened to Cromwell here, it would not be up to Kevin to imagine the chaos that would happen in Jarrosus City.

source: 魔法天赋强得变态不说，还精通锻造和药剂，最要命的是，这小王八蛋的年纪才不过二十岁！
en_us: No need to even mention his exceptional talent in magic, he was also skilled in forging and pharmaceutics. What was most appalling was that, this little bastard was not even over twenty!

source: 魔法家族拥有庞大的财富，也拥有令人眼红的权势，可药剂师公会又岂是财富和权势所能打动的？
en_us: The mage families had great wealth and enviable power, but the Pharmacists Guild was not as much an object of wealth and power.

source: 魔法师与魔法学徒，一步天堂，一步地狱……
en_us: A mage and a mage apprentice. It was one of heaven, and one of hell...

source: 鲁本－萨鲁曼也是狠人一个，否则当年也不会一夜之间杀尽父亲兄弟，黑色法师袍下的枯瘦手臂一抬：“五十五万。”
en_us: Reuben Saruman was also a ruthless character; if not, he wouldn't have killed his father and brother in one night. An emaciated arm was raised from under the black mage robe. "550,000."

source: 鲁本－萨鲁曼经过后排的时候，头也不回的丢了一句话给葛瑞安：“你欠我一个人情！”
en_us: When Reuben Saruman passed by the last row, he dropped a word to Gerian without a look back. "You owe me a favor!"

source: 鲁本－萨鲁曼这个价格一出，在场所有人都彻底相信了，这家伙真的是个疯子，八十万金币丢出去，竟是连眉头都没皱一下，这绝对是真正的天价！就算这是奥法药剂又怎么样，有了这八十万金币，就算是用钱砸，也能砸出十个五级魔法师来了……
en_us: As soon as Reuben Saruman uttered the price, everyone present had fully believed the fellow to be a lunatic. 800,000 gold coins were thrown out without even a wrinkling of his brows. This was an absolute sky-high price! So what if this was the Arcane Magic Potion? With this 800,000 gold coins, you could get ten level-five mages with a just a throw of the money...

source: 鲜血乱喷的双足飞龙本就极端虚弱，此时一记迟缓术上身，更是仿佛拉着破车的老牛，任它如何拼命挣扎，那区区十几步距离，也仿佛成了一道永远无法跨越的鸿沟。
en_us: The bloodied Wyvern was already at its weakest. Now that the Delaying Spell was cast, it was like an old bullock pulling a broken cart trundling along. No matter how hard it struggled, it seemed that the distance of a dozen steps was a gap that could never be crossed to it.

source: 鹤大师从楼梯上匆匆走进来，一眼就锁定了坐楼顶雅阁内一个名黄裳少女，眼中立即露出一丝溺爱和尊敬之色。
en_us: Master He hurried up the stairs and walked up to the top floor. With one look, his eyes locked on a young lady dressed in yellow apparel sitting in the elegent pavilion on the top floor. Those eyes immediately immediately gave a look of doting love and respect.

source: 鹤大师伸手朝下面一指道：“这是下面一名少年拿来出售的。”
en_us: Master He stretched out his hand and pointed a finger downwards, replying, "A young man downstairs was trying to sell this."
